updated mermaid charts
